#pragma once
#include<iostream>
using std::string;
using std::cout;
using std::cin;
using std::endl;

void menuMain()
{
	cout << "******************************************" << endl;
	cout << "***************1.添加联系人***************" << endl;
	cout << "***************2.显示联系人***************" << endl;
	cout << "***************3.删除联系人***************" << endl;
	cout << "***************4.查找联系人***************" << endl;
	cout << "***************5.修改联系人***************" << endl;
	cout << "***************6.清空联系人***************" << endl;
	cout << "***************0.返回上级菜单*************" << endl;
	cout << "******************************************" << endl;
};
void menuModify()
{
	cout << "******************************************" << endl;
	cout << "***************1.修改联系人姓名************" << endl;
	cout << "***************2.修改联系人性别************" << endl;
	cout << "***************3.修改联系人年龄************" << endl;
	cout << "***************4.修改联系人电话号码********" << endl;
	cout << "***************5.修改联系人家庭住址********" << endl;
	cout << "***************0.返回上级菜单*************" << endl;
	cout << "******************************************" << endl;
};
void menuFind()
{
	cout << "******************************************" << endl;
	cout << "***************1.以联系人编号查找**********" << endl;
	cout << "***************2.以联系人姓名查找**********" << endl;
	cout << "***************3.以联系人电话号码查找******" << endl;
	cout << "***************0.返回上级菜单*************" << endl;
	cout << "******************************************" << endl;
};
void menuDelete()
{
	cout << "******************************************" << endl;
	cout << "***************1.以联系人编号删除**********" << endl;
	cout << "***************2.以联系人姓名删除**********" << endl;
	cout << "***************3.以联系人电话号码删除******" << endl;
	cout << "***************0.返回上级菜单*************" << endl;
	cout << "******************************************" << endl;
};
void menumodify()
{
	cout << "******************************************" << endl;
	cout << "******1.以联系人编号查找欲修改的联系人******" << endl;
	cout << "******2.以联系人姓名查找欲修改的联系人******" << endl;
	cout << "****3.以联系人电话号码查找欲修改的联系人****" << endl;
	cout << "***************0.返回上级菜单*************" << endl;
	cout << "******************************************" << endl;
};