#pragma once
#include<iostream>
using std::cout;
using std::endl;
using std::cin;
void mainMenu()
{
	{
		cout << "******************************************" << endl;
		cout << "*************欢迎参加演讲比赛**************" << endl;
		cout << "****************1.开始比赛****************" << endl;
		cout << "**************2.查看往届记录***************" << endl;
		cout << "**************3.清空比赛记录***************" << endl;
		cout << "***************0.退出比赛程序*************" << endl;
		cout << "******************************************" << endl;
	};
}